user/tutorials/Nike/TML_reacting_Turb/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          32768;
        startFace       65152;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          32768;
        startFace       97920;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          256;
        startFace       130688;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          256;
        startFace       130944;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    bottom
    {
        type            patch;
        nFaces          128;
        startFace       131200;
    }
    top
    {
        type            patch;
        nFaces          128;
        startFace       131328;
    }
)

// ************************************************************************* //
